app/Http/Controllers/ProfileController.php

    public function index(Request $request)
    {
        $profiles = Profile::all();
---
select * from `profiles`