app/Http/Controllers/Admin/NewsController.php

  public function create(Request $request)
  {
      // admin/news/createにリダイレクトする
  $this->validate($request, News::$rules);

      $news = new News;
      $form = $request->all();

      // フォームから画像が送信されてきたら、保存して、$news->image_path に画像のパスを保存する
      if (isset($form['image'])) {
        $path = $request->file('image')->store('public/image');
        $news->image_path = basename($path);
      } else {
          $news->image_path = null;
      }

      // フォームから送信されてきた_tokenを削除する
      unset($form['_token']);
      // フォームから送信されてきたimageを削除する
      unset($form['image']);

      // データベースに保存する
      $news->fill($form);
      $news->save();
---
insert into `news` (`image_path`, `title`, `body`, `updated_at`, `created_at`) values ('PdS3Nt40QwwMhLonQruk78zs6AsOYvDofDYucaqz.png', 'aaaa', 'aaaaa', '2020-01-18 22:43:14', '2020-01-18 22:43:14')

public function index(Request $request)
  {
      $cond_title = $request->cond_title;
      if ($cond_title != '') {
          // 検索されたら検索結果を取得する
          $posts = News::where('title', $cond_title)->get();
      } else {
          // それ以外はすべてのニュースを取得する
          $posts = News::all();
---
select * from `news`

public function delete(Request $request)
  {
      // 該当するNews Modelを取得
      $news = News::find($request->id);
      // 削除する
      $news->delete();
---
delete from `news` where `id` = 6